[
  {
    "title": "How JSON Schema Was an Obvious Choice at GitHub",
    "summary": "At GitHub's Docs Engineering team, while shipping releases to production 20 times per day or more, JSON Schema is critical in increasing confidence in changes to data, content and APIs.",
    "logo": "/img/logos/github-logo.svg",
    "links": {
      "lang": "URL1",
      "url": "/blog/posts/github-case-study"
    }
  },
  {
    "title": "How 6 River Systems saves time and boosts collaboration with JSON Schema",
    "summary": "Explore the powerful impact of JSON Schema on 6 River Systems' fulfillment operations. Discover how they enabled enhanced collaboration, time savings, and data quality assurance, propelling their successful scaling journey.",
    "logo": "/img/logos/6river-logo.svg",
    "links": {
      "lang": "URL1",
      "url": "/blog/posts/6-river-systems-case-study"
    }
  },
  {
    "title": "Transforming the technical recruiting industry with JSON Schema",
    "summary": "Learn how Manfred used JSON Schema to transform the technical recruiting industry.",
    "logo": "/img/logos/manfred-color.svg",
    "links": {
      "lang": "URL1",
      "url": "/blog/posts/manfred-case-study"
    }
  },
  {
    "title": "How Postman uses JSON Schema",
    "summary": "Learn how JSON Schema continues to be a crucial component of the Postman API Platform and the API ecosystem.",
    "logo": "/img/logos/sponsors/postman_logo-orange.svg",
    "links": {
      "lang": "URL1",
      "url": "/blog/posts/postman-case-study"
    }
  },
  {
    "title": "Using JSON Schema at Remote to scale forms and data validations",
    "summary": "Using JSON Schema at Remote was the first step to solving data validation and form generation problems across all levels at Remote.",
    "logo": "/img/logos/remote-logo.png",
    "links": {
      "lang": "URL1",
      "url": "/blog/posts/remote-case-study"
    }
  },
  {
    "title": "How Tyler Technologies reduced its client feedback loop with JSON Schema",
    "summary": "Using JSON Schema at Tyler Technologies meant showing added value to clients could take minutes rather than days or in some cases weeks.",
    "logo": "/img/logos/tyler-tech-logo.svg",
    "links": {
      "lang": "URL1",
      "url": "/blog/posts/tyler-technologies-case-study"
    }
  },
  {
    "title": "How the W3C Web of Things brings JSON Schema to the Internet of Things",
    "summary": "Using JSON Schema at the W3C Web of Things to create an interoperability layer so that different IoT platforms, protocols and standards can operate together.",
    "logo": "/img/logos/wot-logo.png",
    "links": {
      "lang": "URL1",
      "url": "/blog/posts/w3c-wot-case-study"
    }
  },
  {
    "title": "JSON Schema deduplicated complex logic and validation at Cookpad",
    "summary": "Learn how Cookpad used JSON Schema to reduce incomplete input of newly registered items from 10% to 0%.",
    "logo": "/img/logos/cookpad-logo.png",
    "links": {
      "lang": "URL1",
      "url": "/blog/posts/cookpad-case-study-en"
    }
  }
]
